# Terraform environment tt02
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.appsettings.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
module.rbac.data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac.data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_storage_account.use_lease[0]: Reading...
module.rbac.data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Storage/storageAccounts/staltinnauth001tt02]
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_storage_account.use_lease[0]: Read complete after 0s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Storage/storageAccounts/staltinnauth001tt02]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_storage_account.use_lease[0]: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Storage/storageAccounts/staltinnauth001tt02]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02]
module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02]
module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.aks_federation["https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/d118512b-ed4c-4387-8ef5-c893a1e7b788/"] will be destroyed
  # (because azurerm_federated_identity_credential.aks_federation is not in configuration)
  - resource "azurerm_federated_identity_credential" "aks_federation" {
      - audience            = [
          - "api://AzureADTokenExchange",
        ] -> null
      - id                  = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthaccessmgmt001tt02/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mialtinnauthaccessmgmt001tt02/federatedIdentityCredentials/Aks" -> null
      - issuer              = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/d118512b-ed4c-4387-8ef5-c893a1e7b788/" -> null
      - name                = "Aks" -> null
      - parent_id           = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthaccessmgmt001tt02/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mialtinnauthaccessmgmt001tt02" -> null
      - resource_group_name = "rgaltinnauthaccessmgmt001tt02" -> null
      - subject             = "system:serviceaccount:default:altinn-access-management" -> null
    }

  # module.appsettings.azurerm_app_configuration_feature.configuration["AccessManagement.HostedServices.RegisterSync_tt02-access-management"] will be created
  + resource "azurerm_app_configuration_feature" "configuration" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + description            = "Specifies if the register data should streamed from register service to access management database"
      + enabled                = false
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "AccessManagement.HostedServices.RegisterSync"
      + label                  = "tt02-access-management"
      + locked                 = false
      + name                   = "AccessManagement.HostedServices.RegisterSync"
    }

  # module.rbac.azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "60bb753a-94db-459a-bd95-ee87443b6c0e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Storage/storageAccounts/staltinnauth001tt02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].azurerm_role_assignment.use_app_configuration[0] will be created
  + resource "azurerm_role_assignment" "use_app_configuration" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Reader"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Storage/storageAccounts/staltinnauth001tt02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"].azurerm_role_assignment.use_masstransit[0] will be created
  + resource "azurerm_role_assignment" "use_masstransit" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1f5bc37d-3a69-4fbb-b2f2-c1da190cd0d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].azurerm_role_assignment.use_app_configuration[0] will be created
  + resource "azurerm_role_assignment" "use_app_configuration" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7df20147-fff7-4c9b-a28d-07a0005687d3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Reader"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7df20147-fff7-4c9b-a28d-07a0005687d3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Storage/storageAccounts/staltinnauth001tt02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac_platform_app["7df20147-fff7-4c9b-a28d-07a0005687d3"].azurerm_role_assignment.use_masstransit[0] will be created
  + resource "azurerm_role_assignment" "use_masstransit" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7df20147-fff7-4c9b-a28d-07a0005687d3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.AccessManagement/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/tt02/altinn.accessmanagement.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_tt02_altinn.accessmanagement.tfstate.tfplan`